app/controllers/places_controller.rb

  def index

    if params[:lat] && params[:long]
      @places = Place::find_from_coordinates(params[:lat], params[:long])
      #TODO sort by distance to here
    else
      @places = Place.all
---
SELECT "places".* FROM "places"

  def show
    @place = Place::find_by_id(params[:id])
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @place = Place.new(params[:place])

    respond_to do |format|
      if @place.save
---
INSERT INTO "places" ("created_at", "description", "latitude", "longitude", "name", "type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)